apache/nuttx/arch/arm/src/stm32h5/hardware/stm32h5xxx_spi.h
#define SPI_TXDR_TXDR_SHIFT      (0) /* Bits 0-15: transmit data register */
#define SPI_TXDR_TXDR_MASK       (0xffff << SPI_TXDR_TXDR_SHIFT)
                                     /* Bits 16-31: write ignored */

/* SPI/I2S receive data register */

#define SPI_RXDR_RXDR_SHIFT      (0) /* Bits 0-15: receive data register */
#define SPI_RXDR_RXDR_MASK       (0xffff << SPI_RXDR_RXDR_SHIFT)
                                     /* Bits 16-31: read zero */

/* SPI/I2S SPI polynominal register */

#define SPI_CRCPOLY_CRCPOLY_SHIFT      (0) /* Bits 0-15: CRC polynominal register */
#define SPI_CRCPOLY_CRCPOLY_MASK       (0xffff << SPI_CRCPOLY_CRCPOLY_SHIFT)
                                           /* Bits 16-31: write ignored */

/* SPI/I2S SPI transmitter CRC register */

#define SPI_TXCRC_TXCRC_SHIFT      (0) /* Bits 0-15: CRC register for transmitter */
#define SPI_TXCRC_TXCRC_MASK       (0xffff << SPI_TXCRC_TXCRC_SHIFT)
                                       /* Bits 16-31: write ignored */

/* SPI/I2S SPI receiver CRC register */

#define SPI_RXCRC_RXCRC_SHIFT      (0) /* Bits 0-15: CRC register for receiver */
#define SPI_RXCRC_RXCRC_MASK       (0xffff << SPI_RXCRC_RXCRC_SHIFT)
                                       /* Bits 16-31: read zero */

/* SPI/I2S SPI underrun data register */

#define SPI_UDRDR_UDRDR_SHIFT      (0) /* Bits 0-15: data at slave underrun condition*/
#define SPI_UDRDR_UDRDR_MASK       (0xffff << SPI_UDRDR_UDRDR_SHIFT)
                                       /* Bits 16-31: read zero */

/* SPI/I2S configuration register */

#define SPI_I2SCFGR_I2SMOD         (1 << 0)  /* Bit 0:  I2S Mode Selection */

#define SPI_I2SCFGR_I2SCFG_SHIFT   (1) /* Bits 3:1: I2S Configuration Mode */
#define SPI_I2SCFGR_I2SCFG_MASK    (0x7 << SPI_I2SCFGR_I2SCFG_SHIFT)
#define SPI_I2SCFGR_I2SCFG_STX     (0 << SPI_I2SCFGR_I2SCFG_SHIFT)
#define SPI_I2SCFGR_I2SCFG_SRX     (1 << SPI_I2SCFGR_I2SCFG_SHIFT)
#define SPI_I2SCFGR_I2SCFG_MTX     (2 << SPI_I2SCFGR_I2SCFG_SHIFT)
#define SPI_I2SCFGR_I2SCFG_MRX     (3 << SPI_I2SCFGR_I2SCFG_SHIFT)
#define SPI_I2SCFGR_I2SCFG_SFD     (4 << SPI_I2SCFGR_I2SCFG_SHIFT)
#define SPI_I2SCFGR_I2SCFG_MFD     (5 << SPI_I2SCFGR_I2SCFG_SHIFT)

#define SPI_I2SCFGR_I2SSTD_SHIFT   (4) /* Bits 5:4: I2S Standard Selection */
#define SPI_I2SCFGR_I2SSTD_MASK    (0x3 << SPI_I2SCFGR_I2SSTD_SHIFT)
#define SPI_I2SCFGR_I2SCFG_PHIL    (0 << SPI_I2SCFGR_I2SCFG_SHIFT)
#define SPI_I2SCFGR_I2SCFG_MSB     (1 << SPI_I2SCFGR_I2SCFG_SHIFT)
#define SPI_I2SCFGR_I2SCFG_LSB     (2 << SPI_I2SCFGR_I2SCFG_SHIFT)
#define SPI_I2SCFGR_I2SCFG_PCM     (3 << SPI_I2SCFGR_I2SCFG_SHIFT)

#define SPI_I2SCFGR_PCMSYNC        (1 << 7)  /* Bit 7:  PCM Frame Synchronization */

#define SPI_I2SCFGR_DATLEN_SHIFT   (8) /* Bits 9:8: Data Length to be Transferred */
#define SPI_I2SCFGR_DATLEN_MASK    (0x3 << SPI_I2SCFGR_DATLEN_SHIFT)
#define SPI_I2SCFGR_DATLEN_16      (0 << SPI_I2SCFGR_DATLEN_SHIFT)
#define SPI_I2SCFGR_DATLEN_24      (1 << SPI_I2SCFGR_DATLEN_SHIFT)
#define SPI_I2SCFGR_DATLEN_32      (2 << SPI_I2SCFGR_DATLEN_SHIFT)

#define SPI_I2SCFGR_CHLEN          (1 << 10) /* Bit 10: Channel Length (n-bits / audio channel) */
#define SPI_I2SCFGR_CKPOL          (1 << 11) /* Bit 11: Serial Audio CLock Polarity */
#define SPI_I2SCFGR_FIXCH          (1 << 12) /* Bit 12: Fixed Channel Length in Slave */
#define SPI_I2SCFGR_WSINV          (1 << 13) /* Bit 13: Word Select Inversion */
#define SPI_I2SCFGR_DATAFMT        (1 << 14) /* Bit 14: Data Format */

#define SPI_I2SCFGR_I2SDIV_SHIFT   (16) /* Bits 23:16: I2S Linear Prescaler */
#define SPI_I2SCFGR_I2SDIV_MASK    (0xff << SPI_I2SCFGR_I2SDIV_SHIFT)
#define SPI_I2SCFGR_I2SDIV(n)      (n << SPI_I2SCFGR_I2SDIV_SHIFT)

#define SPI_I2SCFGR_ODD            (1 << 24) /* Bit 24: Odd Factor for the Prescaler */
#define SPI_I2SCFGR_MCKOE          (1 << 25) /* Bit 24: Master Clock Output Enable */

#endif /* CONFIG_STM32_STM32H5XXX */
#endif /* __ARCH_ARM_SRC_STM32H5_HARDWARE_STM32H5XXX_SPI_H */
